In [1]:
import pandas as pd

# 创建示例DataFrame
data = {
    '姓名': ['张三', '李四', '王五', '赵六', '钱七'],
    '年龄': [25, 30, 35, 28, 32],
    '城市': ['北京', '上海', '广州', '深圳', '北京'],
    '薪资': [15000, 20000, 25000, 18000, 22000]
}
df = pd.DataFrame(data)

In [ ]:
# 使用 iloc 基于索引的访问,特别注意,如果要指定列,可以用get_loc('ColumnName')获取列的数字索引
df.iloc[:, df.columns.get_loc('姓名')]

0    张三
1    李四
2    王五
3    赵六
4    钱七
Name: 姓名, dtype: object

In [3]:
df['姓名']

0    张三
1    李四
2    王五
3    赵六
4    钱七
Name: 姓名, dtype: object

In [4]:
df.iloc[:, df.columns.get_loc('姓名')]

0    张三
1    李四
2    王五
3    赵六
4    钱七
Name: 姓名, dtype: object

In [5]:
df.columns

Index(['姓名', '年龄', '城市', '薪资'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df[pd.Series([True,True,False,False,True])]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [11]:
df['年龄']<30

0     True
1    False
2    False
3     True
4    False
Name: 年龄, dtype: bool

In [12]:
pd.Series([True,True,False,False,False])

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [18]:
df.loc[[0,1,4],:]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [ ]:
df.iloc[[0,1,],:]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [24]:
df[(df["城市"] == "上海") | (df["城市"] == "北京")]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [27]:
s=(df["城市"] == "上海") | (df["城市"] == "北京")
s

0     True
1     True
2    False
3    False
4     True
Name: 城市, dtype: bool

In [31]:
df.loc[[0,1,4]]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [32]:
s=[True,True,False,False,True]
df[pd.Series(s)]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [33]:
s=[True,True,False,False,True]
df[s]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [35]:
df[[True,True,False,False,True]]

   姓名  年龄  城市     薪资
0  张三  25  北京  15000
1  李四  30  上海  20000
4  钱七  32  北京  22000

In [ ]:
df['城市'].str

In [2]:
import pandas as pd
dates = pd.date_range("20130101", periods=6)

In [5]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [6]:
dates[0]

Timestamp('2013-01-01 00:00:00')